In [10]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series(range(100, 110))

In [6]:
s.dtype

dtype('int64')

In [7]:
pd.Series({"apple": "A sweet red", "mango": "King of fruits"})

apple       A sweet red
mango    King of fruits
dtype: object

In [8]:
pd.Series(["King of fruits", "A sweet red"], index = ["apple", "mango"])

apple    King of fruits
mango       A sweet red
dtype: object

In [12]:
ind = np.random.randint(50, 100, (5,))

In [16]:
cols = ["A", "B", "C", "D", "E"]

In [17]:
pd.DataFrame(np.random.randint(10, 20, (5,5)), index = ind, columns = cols)

     A   B   C   D   E
84  10  10  17  15  15
62  17  17  11  11  15
72  13  18  15  13  12
74  15  17  15  15  17
92  13  10  11  11  12

In [19]:
names = ["Anuj", "Naman", "Mohit"]
ages = [26, 21, 28]

In [20]:
d = {"names": names, "ages": ages}

In [21]:
pd.DataFrame(d)

   names  ages
0   Anuj    26
1  Naman    21
2  Mohit    28

In [23]:
d2 = [{"name": "Himanshu", "age": 27}, {"name":"Anuj", "age":34}]

In [25]:
df = pd.DataFrame(d2)

In [29]:
df.to_csv("hello.csv", index = False, sep=";", line_terminator= "-")

In [30]:
df = pd.read_csv("hello.csv", sep=";", lineterminator="-")

       name  age
0  Himanshu   27
1      Anuj   34

In [31]:
df.to_excel("hello.xls")

In [32]:
df.name

0    Himanshu
1        Anuj
Name: name, dtype: object

In [33]:
df.age

0    27
1    34
Name: age, dtype: int64

In [34]:
df["name"]

0    Himanshu
1        Anuj
Name: name, dtype: object

In [38]:
df["place"] = ["Delhi"] * 2

In [39]:
df

       name  age  place
0  Himanshu   27  Delhi
1      Anuj   34  Delhi

In [40]:
df[["name", "place"]]

       name  place
0  Himanshu  Delhi
1      Anuj  Delhi

In [42]:
df.loc[df.age > 30]

   name  age  place
1  Anuj   34  Delhi

In [43]:
df.iloc[1:]

   name  age  place
1  Anuj   34  Delhi

In [45]:
df.iloc[0:, 1:]

   age  place
0   27  Delhi
1   34  Delhi

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
name     2 non-null object
age      2 non-null int64
place    2 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [48]:
another = df.describe()

In [50]:
df.sort_index(axis = 1, ascending = False)

   place      name  age
0  Delhi  Himanshu   27
1  Delhi      Anuj   34

In [51]:
df.sort_index(axis = 0, ascending = False)

       name  age  place
1      Anuj   34  Delhi
0  Himanshu   27  Delhi

In [53]:
df.sort_values("age", ascending = False)

       name  age  place
1      Anuj   34  Delhi
0  Himanshu   27  Delhi

In [54]:
data = pd.DataFrame(np.random.randint(10, 20, (5,5)))

In [57]:
data

    0   1   2   3   4
0  10  15  12  17  19
1  13  15  17  16  15
2  19  13  16  19  13
3  17  12  19  12  17
4  17  11  11  18  13

In [58]:
data.sort_values(2, axis = 1)

    1   4   2   0   3
0  15  19  12  10  17
1  15  15  17  13  16
2  13  13  16  19  19
3  12  17  19  17  12
4  11  13  11  17  18

In [59]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [60]:
df.columns

Index(['name', 'age', 'place'], dtype='object')

In [62]:
b = df.sort_values("age")

In [63]:
b.index

Int64Index([0, 1], dtype='int64')

In [64]:
b.values

array([['Himanshu', 27, 'Delhi'],
       ['Anuj', 34, 'Delhi']], dtype=object)

In [65]:
data.values.dtype

dtype('int64')

In [66]:
data.loc[0,0]

10

In [67]:
data.at[0,0]

10

In [69]:
df.at[0,"name"] = "King"

In [70]:
df

   name  age  place
0  King   27  Delhi
1  Anuj   34  Delhi

In [71]:
df.iloc[:, -1] = "Noida"

In [72]:
df

   name  age  place
0  King   27  Noida
1  Anuj   34  Noida

In [81]:
def inc(item):
    item.age += 1
    return item

In [82]:
df.apply(inc, axis = 1)

   name  age  place
0  King   28  Noida
1  Anuj   35  Noida